{"format": "keras", "nodes": [{"name": "input_2", "id": "input_2", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "resnet50", "id": "resnet50", "class_name": "Functional", "output_shape": [null, 2048], "num_parameters": 23587712}, {"name": "dropout", "id": "dropout", "class_name": "Dropout", "output_shape": [null, 2048], "num_parameters": 0}, {"name": "dense", "id": "dense", "class_name": "Dense", "output_shape": [null, 10], "num_parameters": 20490}], "edges": [["input_2", "resnet50"], ["resnet50", "dropout"], ["dropout", "dense"]]}